#ifndef __proverbs__
#define __proverbs__

//------------------------------------------------------------------------------
// proverbs.h 
//------------------------------------------------------------------------------

#include <stdio.h>
using namespace std;

# include "rnd.h"

//------------------------------------------------------------------------------
// Пословица.
struct proverbs {
    char* country; // Страна пословицы.
    char* proverb;
};

// Ввод параметров пословицы из файла.
void In(proverbs& p, FILE* file);

// Случайный ввод параметров пословицы.
void InRnd(proverbs& p);

// Вывод параметров пословицы в форматируемый поток.
void Out(proverbs& p, FILE* file);

// Вычисление частного от количества знаков препинания в пословице на длину этой пословицы.
double Quotient(proverbs& p);

#endif //__proverbs__
