#ifndef __riddles__
#define __riddles__

//------------------------------------------------------------------------------
// riddles.h
//------------------------------------------------------------------------------

#include <stdio.h>
using namespace std;

# include "rnd.h"

//------------------------------------------------------------------------------
// Загадка.
struct riddles {
    char* answer; // Ответ на загадку.
    char* riddle; // Загадка.
};

// Ввод параметров загадки из файла.
void In(riddles& r, FILE* file);

// Случайный ввод параметров загадки.
void InRnd(riddles& r);

// Вывод параметров загадки в форматируемый поток.
void Out(riddles& r, FILE* file);

// Вычисление частного от количества знаков препинания в загадке на длину этой загадки.
double Quotient(riddles& r);

#endif //__riddles__
